In [2]:
import pandas as pd
import numpy as np

In [3]:
# import data
owners=pd.read_csv("/Users/srikarprayaga/Desktop/Denver-Broncos-Data-Science-Intern-Prework-/data/owners.csv")
pets=pd.read_csv("/Users/srikarprayaga/Desktop/Denver-Broncos-Data-Science-Intern-Prework-/data/pets.csv")
procedure_details=pd.read_csv("/Users/srikarprayaga/Desktop/Denver-Broncos-Data-Science-Intern-Prework-/data/procedure_details.csv")
procedures=pd.read_csv("/Users/srikarprayaga/Desktop/Denver-Broncos-Data-Science-Intern-Prework-/data/procedures.csv")

In [5]:
owners.head(10)

,OwnerID,Name,Surname,StreetAddress,City,State,StateFull,ZipCode
0,6049,Debbie,Metivier,315 Goff Avenue,Grand Rapids,MI,Michigan,49503
1,2863,John,Sebastian,3221 Perry Street,Davison,MI,Michigan,48423
2,3518,Connie,Pauley,1539 Cunningham Court,Bloomfield Township,MI,Michigan,48302
3,3663,Lena,Haliburton,4217 Twin Oaks Drive,Traverse City,MI,Michigan,49684
4,1070,Jessica,Velazquez,3861 Woodbridge Lane,Southfield,MI,Michigan,48034
5,7101,Bessie,Yen,30 Cunningham Court,Rochester Hills,MI,Michigan,48306
6,2419,Luisa,Cuellar,1308 Shingleton Road,Kalamazoo,MI,Michigan,49007
7,6194,Karen,Torres,3941 Ritter Avenue,Center Line,MI,Michigan,48015
8,5833,Mary,Hurtado,4865 Juniper Drive,Saint Charles,MI,Michigan,48655
9,9614,Carmen,Ingram,1056 Eagle Drive,Detroit,MI,Michigan,48219

In [6]:
pets.head(10)

     PetID        Name    Kind  Gender  Age  OwnerID
0  J6-8562      Brandy     Dog    male   11     5168
1  Q0-2001      Roomba     Cat    male    9     5508
2  M0-2904       Simba     Cat    male    1     3086
3  R3-7551      Keller  Parrot  female    2     7908
4  P2-7342     Cuddles     Dog    male   13     4378
5  X0-8765     Vuitton  Parrot  female   11     7581
6  Z4-5652       Priya     Cat  female    7     7343
7  Z4-4045       Simba     Cat    male    0     2700
8  M8-7852      Cookie     Cat  female    8     7606
9  J2-3320  Heisenberg     Dog    male    3     1319

In [10]:
procedure_details.head(10)

  ProcedureType  ProcedureSubCode      Description  Price
0   OFFICE FEES                 1      Office Call     32
1   OFFICE FEES                 2        Emergency    100
2   OFFICE FEES                 3             Reck     24
3      GROOMING                 1             Bath     15
4      GROOMING                 2         Flea Dip     15
5      GROOMING                 3       Flea Spray     10
6  VACCINATIONS                 1  Galaxie (DHLPP)     15
7  VACCINATIONS                 2         Leukemia     20
8  VACCINATIONS                 3             Lyme     15
9  VACCINATIONS                 4              PCR     15

In [11]:
procedures.head(10)

     PetID   Date ProcedureType  ProcedureSubCode
0  T0-3277  42391  VACCINATIONS                 5
1  G6-6501  42398  VACCINATIONS                 5
2  P9-3625  42399    ORTHOPEDIC                 7
3  F1-1855  42402  VACCINATIONS                 5
4  S1-2243  42404  VACCINATIONS                 5
5  L8-0046  42405  VACCINATIONS                 5
6  L4-6292  42405  VACCINATIONS                 5
7  X0-8765  42447  VACCINATIONS                 5
8  J8-7429  42494  VACCINATIONS                 5
9  J8-7429  42498  VACCINATIONS                 5